In [21]:
import pandas
from pandas import *
import pylab
from pylab import *

In [22]:
names = read_csv('mentor3.csv')

In [50]:
names.ix[2:5, ['name','sex','email']]

                     name sex                         email
2  ISHIMWE     FLORENTINE   m  ishimwe.frorentine@yahoo.com
3        UWAMAHORO DENYSE  mf          udenise100@gmail.com
4       KABATESI BLANDINE   f       brandytesh133@gmail.com
5            UWERA BEATHE   m          uwerabet20@gmail.com

In [51]:
gnames = names[names['sex'] == 'f']
bnames = names[names['sex'] == 'm']
gnames.head(2)

,sn,sex,name,reg,tel,email,mentor,Unnamed: 7,Unnamed: 8,Unnamed: 9
4,5,f,KABATESI BLANDINE,215030176,787905008.0,brandytesh133@gmail.com,Mr. Henry Kirya,NaN,NaN,NaN
10,11,f,KARUNUGABO PASCAL,215030219,727435796.0,pkarugabo@yahoo.com,Mr.Nkwanga Tonny,NaN,NaN,NaN

In [52]:
bnames.head(2)

,sn,sex,name,reg,tel,email,mentor,Unnamed: 7,Unnamed: 8,Unnamed: 9
0,1,m,NGABO TRESOR,215030323,785186217.0,ngatreso1@gmai.com,Mr. Henry Kirya,NaN,NaN,NaN
1,2,m,LAETITIA NYAMPUNDU,215026909,788395278.0,laetitiadidy@gmail.com,Mr. Henry Kirya,NaN,NaN,NaN

In [55]:
nam = names[names['reg'] == 215030323]

In [61]:
gnames2 = gnames.ix[0:, ['sex','name', 'reg']]
gnames2 = gnames2.set_index(['reg'])

In [63]:
gnames2[:3]

          sex               name
reg
215030176   f  KABATESI BLANDINE
215030219   f  KARUNUGABO PASCAL
215030237   f  KUBWIMANA CHARLES